; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=77, out_folder=htg/blocksworld//training, instance_id=57, seed=2081

(define (problem blocksworld-57)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 - object)
 (:init 
    (arm-empty)
    (clear b64)
    (on b64 b18)
    (on b18 b16)
    (on b16 b44)
    (on b44 b66)
    (on-table b66)
    (clear b1)
    (on b1 b75)
    (on b75 b45)
    (on b45 b65)
    (on b65 b10)
    (on b10 b29)
    (on b29 b5)
    (on b5 b35)
    (on b35 b36)
    (on b36 b38)
    (on b38 b24)
    (on b24 b46)
    (on b46 b76)
    (on b76 b6)
    (on b6 b77)
    (on b77 b32)
    (on b32 b40)
    (on b40 b54)
    (on b54 b11)
    (on b11 b43)
    (on b43 b62)
    (on b62 b14)
    (on b14 b52)
    (on b52 b49)
    (on b49 b17)
    (on-table b17)
    (clear b70)
    (on b70 b42)
    (on b42 b4)
    (on b4 b3)
    (on b3 b13)
    (on b13 b59)
    (on b59 b22)
    (on b22 b41)
    (on b41 b15)
    (on b15 b37)
    (on b37 b55)
    (on-table b55)
    (clear b34)
    (on b34 b2)
    (on-table b2)
    (clear b7)
    (on b7 b57)
    (on-table b57)
    (clear b31)
    (on-table b31)
    (clear b72)
    (on b72 b28)
    (on b28 b73)
    (on b73 b39)
    (on b39 b51)
    (on b51 b63)
    (on b63 b30)
    (on b30 b60)
    (on b60 b74)
    (on-table b74)
    (clear b67)
    (on b67 b33)
    (on b33 b71)
    (on-table b71)
    (clear b50)
    (on b50 b20)
    (on b20 b48)
    (on b48 b12)
    (on b12 b19)
    (on b19 b21)
    (on-table b21)
    (clear b47)
    (on b47 b27)
    (on b27 b68)
    (on b68 b26)
    (on-table b26)
    (clear b53)
    (on b53 b23)
    (on b23 b56)
    (on b56 b69)
    (on b69 b9)
    (on b9 b58)
    (on b58 b8)
    (on b8 b25)
    (on b25 b61)
    (on-table b61))
 (:goal  (and 
    (clear b5)
    (on b5 b6)
    (on b6 b1)
    (on b1 b7)
    (on b7 b2)
    (on b2 b3)
    (on b3 b4)
    (on-table b4))))

; plan
1. (unstack b1 b75)
   deleted: (on b1 b75) (clear b1) (arm-empty)
   added: (holding b1) (clear b75)
   goals met: 0 of 8
2. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 1 of 8
3. (unstack b70 b42)
   deleted: (on b70 b42) (clear b70) (arm-empty)
   added: (holding b70) (clear b42)
   goals met: 1 of 8
4. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 1 of 8
5. (unstack b42 b4)
   deleted: (on b42 b4) (clear b42) (arm-empty)
   added: (holding b42) (clear b4)
   goals met: 1 of 8
6. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 1 of 8
7. (unstack b4 b3)
   deleted: (on b4 b3) (clear b4) (arm-empty)
   added: (holding b4) (clear b3)
   goals met: 1 of 8
8. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 8
9. (unstack b3 b13)
   deleted: (on b3 b13) (clear b3) (arm-empty)
   added: (holding b3) (clear b13)
   goals met: 2 of 8
10. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 3 of 8
11. (unstack b34 b2)
   deleted: (on b34 b2) (clear b34) (arm-empty)
   added: (holding b34) (clear b2)
   goals met: 3 of 8
12. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 3 of 8
13. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 3 of 8
14. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 4 of 8
15. (unstack b75 b45)
   deleted: (on b75 b45) (clear b75) (arm-empty)
   added: (holding b75) (clear b45)
   goals met: 4 of 8
16. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 4 of 8
17. (unstack b45 b65)
   deleted: (on b45 b65) (clear b45) (arm-empty)
   added: (holding b45) (clear b65)
   goals met: 4 of 8
18. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 4 of 8
19. (unstack b65 b10)
   deleted: (on b65 b10) (clear b65) (arm-empty)
   added: (holding b65) (clear b10)
   goals met: 4 of 8
20. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 4 of 8
21. (unstack b10 b29)
   deleted: (on b10 b29) (clear b10) (arm-empty)
   added: (holding b10) (clear b29)
   goals met: 4 of 8
22. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 4 of 8
23. (unstack b29 b5)
   deleted: (on b29 b5) (clear b29) (arm-empty)
   added: (holding b29) (clear b5)
   goals met: 5 of 8
24. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 5 of 8
25. (unstack b5 b35)
   deleted: (on b5 b35) (clear b5) (arm-empty)
   added: (holding b5) (clear b35)
   goals met: 4 of 8
26. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 8
27. (unstack b35 b36)
   deleted: (on b35 b36) (clear b35) (arm-empty)
   added: (holding b35) (clear b36)
   goals met: 5 of 8
28. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 5 of 8
29. (unstack b36 b38)
   deleted: (on b36 b38) (clear b36) (arm-empty)
   added: (holding b36) (clear b38)
   goals met: 5 of 8
30. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 5 of 8
31. (unstack b38 b24)
   deleted: (on b38 b24) (clear b38) (arm-empty)
   added: (holding b38) (clear b24)
   goals met: 5 of 8
32. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 5 of 8
33. (unstack b24 b46)
   deleted: (on b24 b46) (clear b24) (arm-empty)
   added: (holding b24) (clear b46)
   goals met: 5 of 8
34. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 5 of 8
35. (unstack b46 b76)
   deleted: (on b46 b76) (clear b46) (arm-empty)
   added: (holding b46) (clear b76)
   goals met: 5 of 8
36. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 5 of 8
37. (unstack b76 b6)
   deleted: (on b76 b6) (clear b76) (arm-empty)
   added: (holding b76) (clear b6)
   goals met: 5 of 8
38. (putdown b76)
   deleted: (holding b76)
   added: (clear b76) (arm-empty) (on-table b76)
   goals met: 5 of 8
39. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 4 of 8
40. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 6 of 8
41. (unstack b1 b7)
   deleted: (on b1 b7) (clear b1) (arm-empty)
   added: (holding b1) (clear b7)
   goals met: 5 of 8
42. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 5 of 8
43. (unstack b7 b57)
   deleted: (on b7 b57) (clear b7) (arm-empty)
   added: (holding b7) (clear b57)
   goals met: 5 of 8
44. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 6 of 8
45. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 6 of 8
46. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 7 of 8
47. (unstack b5 b6)
   deleted: (on b5 b6) (clear b5) (arm-empty)
   added: (holding b5) (clear b6)
   goals met: 5 of 8
48. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 6 of 8
49. (unstack b6 b77)
   deleted: (on b6 b77) (clear b6) (arm-empty)
   added: (holding b6) (clear b77)
   goals met: 6 of 8
50. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 7 of 8
51. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 6 of 8
52. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 8 of 8
